# Pandas

- Series
- DataFrame

### Series- 1D

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=np.array([2,3,4,5,6])
S=pd.Series(data)
S

0    2
1    3
2    4
3    5
4    6
dtype: int32

In [3]:
data

array([2, 3, 4, 5, 6])

In [4]:
data=np.array(['a','b','c','d','e'])
s=pd.Series(data,index=[100,200,300,400,500])
s

100    a
200    b
300    c
400    d
500    e
dtype: object

In [5]:
data={'a':0,'b':0,'c':3,'d':4}
s=pd.Series(data)
s

a    0
b    0
c    3
d    4
dtype: int64

In [6]:
data

{'a': 0, 'b': 0, 'c': 3, 'd': 4}

In [7]:
s=pd.Series(5,index=[1,2,3,4,5])
s

1    5
2    5
3    5
4    5
5    5
dtype: int64

In [8]:
s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [9]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
s[0]

1

In [11]:
s['a']

1

In [12]:
s[2:5]

c    3
d    4
e    5
dtype: int64

# DataFrame - 2D

In [13]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [14]:
data=[['alex',10],['bob',12],['clarks',13]]
df=pd.DataFrame(data)
df

        0   1
0    alex  10
1     bob  12
2  clarks  13

In [15]:
df=pd.DataFrame(data,columns=['name','age'])
df

     name  age
0    alex   10
1     bob   12
2  clarks   13

In [16]:
df=pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    alex   10
1     bob   12
2  clarks   13

In [17]:
data={'name':['a','b','c','d','e'],'Age':[2,3,4,5,6],'rating':[4,5,3,2,1]}
df=pd.DataFrame(data)
df

  name  Age  rating
0    a    2       4
1    b    3       5
2    c    4       3
3    d    5       2
4    e    6       1

In [18]:
df=pd.DataFrame(data,columns=['name','Age','rating','xyz'])
df

  name  Age  rating  xyz
0    a    2       4  NaN
1    b    3       5  NaN
2    c    4       3  NaN
3    d    5       2  NaN
4    e    6       1  NaN

In [19]:
df=pd.DataFrame(data,columns=['name','Age','rating','xyz'],index=['rank1','rank2','rank3','rank4','rank5'])
df

      name  Age  rating  xyz
rank1    a    2       4  NaN
rank2    b    3       5  NaN
rank3    c    4       3  NaN
rank4    d    5       2  NaN
rank5    e    6       1  NaN

In [20]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':15}]
df=pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  15.0

In [21]:
df=pd.DataFrame(data,index=['first','second'])
df

        a   b     c
first   1   2   NaN
second  5  10  15.0

In [22]:
df=pd.DataFrame(data,columns=['a','b1'],index=['first','second'])
df

        a  b1
first   1 NaN
second  5 NaN

In [23]:
d={'one':pd.Series([1,2,3],index=['a','b','c']),
   'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [24]:
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [25]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [26]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [27]:
df['three']=pd.Series([10,20,30,40,50],index=['a','b','c','d','e'])

In [28]:
df

   one  two  three
a  1.0    1     10
b  2.0    2     20
c  3.0    3     30
d  NaN    4     40

In [29]:
df.pop('three')

a    10
b    20
c    30
d    40
Name: three, dtype: int64

In [30]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [31]:
del(df['one'])

In [32]:
df

   two
a    1
b    2
c    3
d    4

In [33]:
d={'one':pd.Series([1,2,3],index=['a','b','c']),
   'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [34]:
df["three"]=pd.Series([10.0,20.02,30.023],index=['a','b','c'])

In [35]:
df['four']=df['one']+df['three']

In [36]:
df

   one  two   three    four
a  1.0    1  10.000  11.000
b  2.0    2  20.020  22.020
c  3.0    3  30.023  33.023
d  NaN    4     NaN     NaN

In [37]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
df.loc[['a']]

In [ ]:
df.loc['a']

In [35]:
df.iloc[1:]

   one  two   three    four
b  2.0    2  20.020  22.020
c  3.0    3  30.023  33.023
d  NaN    4     NaN     NaN

In [36]:
df=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

In [41]:
df

   a  b
0  1  2
1  3  4

In [39]:
df2

   a  b
0  5  6
1  7  8

In [43]:
df.append(df2)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

# Basic Functionality

In [45]:
s=pd.Series(np.random.rand(4))
s

0    0.735634
1    0.817209
2    0.284402
3    0.125245
dtype: float64

In [46]:
s.axes

[RangeIndex(start=0, stop=4, step=1)]

In [48]:
df=pd.DataFrame(np.random.rand(4,5))
df

          0         1         2         3         4
0  0.680157  0.406504  0.025092  0.287895  0.346131
1  0.914056  0.216000  0.115347  0.343086  0.780816
2  0.983803  0.377791  0.859167  0.565425  0.110214
3  0.952343  0.932327  0.946942  0.164717  0.617397

In [49]:
df.axes

[RangeIndex(start=0, stop=4, step=1), RangeIndex(start=0, stop=5, step=1)]

## Empty

In [50]:
s=pd.DataFrame(np.random.rand(4,5))

In [51]:
s

          0         1         2         3         4
0  0.611041  0.648255  0.804059  0.440772  0.194425
1  0.377456  0.877761  0.391062  0.959910  0.039493
2  0.684640  0.828728  0.121107  0.014644  0.069554
3  0.095971  0.572920  0.269107  0.164358  0.501381

In [52]:
s.empty

False

In [53]:
s=pd.Series()

<ipython-input-53-b65245d9df32>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

In [54]:
s

Series([], dtype: float64)

In [55]:
s.empty

True

## Ndim

In [56]:
s=pd.DataFrame(np.random.rand(4,5))

In [57]:
s

          0         1         2         3         4
0  0.623691  0.987946  0.859796  0.245217  0.394964
1  0.349329  0.578938  0.782269  0.174872  0.927970
2  0.285551  0.803165  0.347328  0.208143  0.754789
3  0.180091  0.045052  0.328491  0.420743  0.960002

In [58]:
s.ndim

2

In [66]:
s=pd.Series(np.random.rand(4))
s

0    0.726871
1    0.877816
2    0.660054
3    0.304122
dtype: float64

In [60]:
s.ndim

1

In [62]:
s.values

array([0.63606632, 0.33541614, 0.02518445, 0.69892127])

In [63]:
s

0    0.636066
1    0.335416
2    0.025184
3    0.698921
dtype: float64

In [67]:
s=pd.DataFrame(np.random.rand(4,5))

In [69]:
s.values

array([[0.79691536, 0.09116919, 0.82621627, 0.29575996, 0.29874432],
       [0.80075684, 0.80794186, 0.75955531, 0.37118627, 0.58964449],
       [0.34462816, 0.63368253, 0.32428278, 0.86083488, 0.45336841],
       [0.50670048, 0.99481399, 0.4621304 , 0.61440276, 0.87550317]])

In [71]:
df=pd.DataFrame(np.random.rand(40,5))

In [72]:
df

           0         1         2         3         4
0   0.646904  0.274781  0.504421  0.628969  0.167137
1   0.101835  0.295475  0.776686  0.825391  0.962244
2   0.372125  0.085543  0.574359  0.577685  0.607974
3   0.310991  0.888000  0.349732  0.149861  0.908143
4   0.916611  0.529460  0.321606  0.102031  0.025554
5   0.066786  0.477740  0.390011  0.539906  0.976584
6   0.334832  0.406212  0.455281  0.233706  0.269795
7   0.154003  0.932602  0.784453  0.415899  0.507423
8   0.290637  0.452296  0.865706  0.373073  0.522837
9   0.912599  0.979171  0.087299  0.419642  0.388638
10  0.213020  0.218322  0.287330  0.960086  0.306175
11  0.914471  0.851256  0.333452  0.605013  0.042108
12  0.068597  0.852287  0.112256  0.038307  0.089331
13  0.250853  0.913243  0.238497  0.760917  0.783172
14  0.352773  0.909316  0.286596  0.011440  0.201654
15  0.472703  0.278116  0.244297  0.518520  0.728600
16  0.987867  0.607097  0.707796  0.897221  0.045785
17  0.088601  0.260689  0.038453  0.950927  0.176192
18  0.213503  0.364320  0.288251  0.759651  0.086353
19  0.353605  0.691867  0.210944  0.417395  0.830622
20  0.784976  0.834844  0.540511  0.551171  0.594055
21  0.813303  0.651509  0.311858  0.987431  0.801320
22  0.484093  0.905606  0.287858  0.355296  0.021788
23  0.569145  0.354014  0.512026  0.846049  0.568420
24  0.915942  0.864335  0.546437  0.500051  0.432454
25  0.817702  0.562123  0.765919  0.874816  0.325973
26  0.775254  0.838922  0.322790  0.685852  0.021709
27  0.250391  0.606326  0.863326  0.109153  0.728016
28  0.272844  0.754742  0.962242  0.902450  0.582331
29  0.691583  0.188415  0.575896  0.011155  0.964058
30  0.375417  0.455392  0.806834  0.887283  0.754569
31  0.938349  0.721762  0.343595  0.540056  0.319330
32  0.352104  0.528421  0.296793  0.185383  0.123556
33  0.028220  0.488098  0.625127  0.040005  0.610626
34  0.707606  0.849670  0.657164  0.873085  0.724848
35  0.983449  0.651322  0.637896  0.868384  0.865534
36  0.145288  0.394031  0.019677  0.516089  0.598649
37  0.544605  0.757093  0.642105  0.352324  0.039147
38  0.868456  0.168799  0.503773  0.660994  0.815205
39  0.322905  0.141609  0.463626  0.706110  0.634731

In [74]:
df.head()

          0         1         2         3         4
0  0.646904  0.274781  0.504421  0.628969  0.167137
1  0.101835  0.295475  0.776686  0.825391  0.962244
2  0.372125  0.085543  0.574359  0.577685  0.607974
3  0.310991  0.888000  0.349732  0.149861  0.908143
4  0.916611  0.529460  0.321606  0.102031  0.025554

In [75]:
df.tail()

           0         1         2         3         4
35  0.983449  0.651322  0.637896  0.868384  0.865534
36  0.145288  0.394031  0.019677  0.516089  0.598649
37  0.544605  0.757093  0.642105  0.352324  0.039147
38  0.868456  0.168799  0.503773  0.660994  0.815205
39  0.322905  0.141609  0.463626  0.706110  0.634731

In [76]:
df.head(3)

          0         1         2         3         4
0  0.646904  0.274781  0.504421  0.628969  0.167137
1  0.101835  0.295475  0.776686  0.825391  0.962244
2  0.372125  0.085543  0.574359  0.577685  0.607974

In [77]:
df.tail(4)

           0         1         2         3         4
36  0.145288  0.394031  0.019677  0.516089  0.598649
37  0.544605  0.757093  0.642105  0.352324  0.039147
38  0.868456  0.168799  0.503773  0.660994  0.815205
39  0.322905  0.141609  0.463626  0.706110  0.634731

# Statistics

In [2]:
d={'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
  'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
  'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

In [3]:
s=pd.DataFrame(d)
s

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [4]:
s.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [5]:
s.sum(axis=0)

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [6]:
s.sum(axis=1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [8]:
s['Age'].sum()

382

In [9]:
s['Age'].sum(axis=0)

382

In [11]:
s.count(axis=0)

Name      12
Age       12
Rating    12
dtype: int64

In [12]:
s.count(axis=1)

0     3
1     3
2     3
3     3
4     3
5     3
6     3
7     3
8     3
9     3
10    3
11    3
dtype: int64

In [13]:
s.mean(axis=0)

Age       31.833333
Rating     3.743333
dtype: float64

In [14]:
s.mean(axis=1)

0     14.615
1     14.620
2     14.490
3     12.780
4     16.600
5     16.800
6     13.400
7     18.890
8     21.490
9     17.400
10    27.550
11    24.825
dtype: float64

In [15]:
s.median()

Age       29.50
Rating     3.79
dtype: float64

In [17]:
s.median(axis=0)

Age       29.50
Rating     3.79
dtype: float64

In [18]:
s.median(axis=1)

0     14.615
1     14.620
2     14.490
3     12.780
4     16.600
5     16.800
6     13.400
7     18.890
8     21.490
9     17.400
10    27.550
11    24.825
dtype: float64

In [19]:
s.std()

Age       9.232682
Rating    0.661628
dtype: float64

In [20]:
s.std(axis=0)

Age       9.232682
Rating    0.661628
dtype: float64

In [21]:
s.std(axis=1)

0     14.686608
1     16.093750
2     14.863385
3     14.453263
4     18.950462
5     17.253405
6     13.576450
7     21.368767
8     26.177093
9     17.819091
10    33.163308
11    29.945972
dtype: float64

In [22]:
s.mode()

      Name   Age  Rating
0   Andres  23.0    2.56
1   Betina  25.0    2.98
2    David  30.0    3.20
3   Gasper   NaN    3.24
4     Jack   NaN    3.65
5    James   NaN    3.78
6      Lee   NaN    3.80
7    Ricky   NaN    3.98
8    Smith   NaN    4.10
9    Steve   NaN    4.23
10     Tom   NaN    4.60
11     Vin   NaN    4.80

In [23]:
s.min()

Name      Andres
Age           23
Rating      2.56
dtype: object

In [24]:
s.min(axis=0)

Name      Andres
Age           23
Rating      2.56
dtype: object

In [25]:
s.min(axis=1)

0     4.23
1     3.24
2     3.98
3     2.56
4     3.20
5     4.60
6     3.80
7     3.78
8     2.98
9     4.80
10    4.10
11    3.65
dtype: float64

In [27]:
s.max()

Name      Vin
Age        51
Rating    4.8
dtype: object

In [28]:
s.max(axis=0)

Name      Vin
Age        51
Rating    4.8
dtype: object

In [29]:
s.max(axis=1)

0     25.0
1     26.0
2     25.0
3     23.0
4     30.0
5     29.0
6     23.0
7     34.0
8     40.0
9     30.0
10    51.0
11    46.0
dtype: float64

In [30]:
s.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [34]:
s.describe(include=object)

        Name
count     12
unique    12
top     Jack
freq       1

In [32]:
s.describe(include='all')

        Name        Age     Rating
count     12  12.000000  12.000000
unique    12        NaN        NaN
top     Jack        NaN        NaN
freq       1        NaN        NaN
mean     NaN  31.833333   3.743333
std      NaN   9.232682   0.661628
min      NaN  23.000000   2.560000
25%      NaN  25.000000   3.230000
50%      NaN  29.500000   3.790000
75%      NaN  35.500000   4.132500
max      NaN  51.000000   4.800000

In [35]:
s.cumsum()

                                                 Name  Age  Rating
0                                                 Tom   25    4.23
1                                            TomJames   51    7.47
2                                       TomJamesRicky   76   11.45
3                                    TomJamesRickyVin   99   14.01
4                               TomJamesRickyVinSteve  129   17.21
5                          TomJamesRickyVinSteveSmith  158   21.81
6                      TomJamesRickyVinSteveSmithJack  181   25.61
7                   TomJamesRickyVinSteveSmithJackLee  215   29.39
8              TomJamesRickyVinSteveSmithJackLeeDavid  255   32.37
9        TomJamesRickyVinSteveSmithJackLeeDavidGasper  285   37.17
10  TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...  336   41.27
11  TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...  382   44.92

# Function application

In [2]:
df=pd.DataFrame(np.random.rand(5,6))

In [3]:
df

          0         1         2         3         4         5
0  0.592929  0.233043  0.988307  0.974192  0.849151  0.051463
1  0.059978  0.963945  0.972953  0.331128  0.129318  0.566392
2  0.613758  0.129565  0.898144  0.225824  0.433977  0.608088
3  0.259470  0.048083  0.881348  0.330329  0.017340  0.578887
4  0.926578  0.029362  0.887190  0.001208  0.993027  0.470052

In [4]:
df.mean()

0    0.490543
1    0.280800
2    0.925589
3    0.372536
4    0.484563
5    0.454976
dtype: float64

In [5]:
df.mean(axis=0)

0    0.490543
1    0.280800
2    0.925589
3    0.372536
4    0.484563
5    0.454976
dtype: float64

In [6]:
df.mean(axis=1)

0    0.614848
1    0.503952
2    0.484893
3    0.352576
4    0.551236
dtype: float64

In [7]:
df.sum()

0    2.452713
1    1.403998
2    4.627944
3    1.862681
4    2.422813
5    2.274881
dtype: float64

In [8]:
df.sum(axis=0)

0    2.452713
1    1.403998
2    4.627944
3    1.862681
4    2.422813
5    2.274881
dtype: float64

In [9]:
df.sum(axis=1)

0    3.689085
1    3.023713
2    2.909356
3    2.115458
4    3.307417
dtype: float64

In [10]:
df.count(axis=1)

0    6
1    6
2    6
3    6
4    6
dtype: int64

In [11]:
df.count(axis=0)

0    5
1    5
2    5
3    5
4    5
5    5
dtype: int64

# Reindexing

In [12]:
df1=pd.DataFrame(np.random.randn(10,4),columns=['col1','col2','col3','col4'])
df2=pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])

In [13]:
df1

       col1      col2      col3      col4
0 -0.992391  0.089663 -0.158982 -1.236289
1  0.154849  0.772372 -0.442880 -0.499321
2  0.222215 -1.075152 -1.869831 -0.568973
3  0.393661  0.773900  0.091235 -0.170349
4  1.410000 -1.401759 -1.431002  0.731569
5  0.198996 -1.128035 -0.875804  1.144655
6 -0.468655  0.882146 -0.302771 -1.868995
7 -0.606886 -0.389741 -1.317017 -1.770201
8  0.413320 -1.489179  1.502977  0.353632
9  1.082628 -1.347677  0.219713 -0.044999

In [14]:
df2

       col1      col2      col3
0 -0.065259  2.806023  0.976592
1 -0.263802 -0.657153 -1.542347
2  1.213847  1.437288  0.824669
3  1.636961  0.642854  1.365133

In [15]:
df1.reindex_like(df2)

       col1      col2      col3
0 -0.992391  0.089663 -0.158982
1  0.154849  0.772372 -0.442880
2  0.222215 -1.075152 -1.869831
3  0.393661  0.773900  0.091235

In [16]:
df2.reindex_like(df1)

       col1      col2      col3  col4
0 -0.065259  2.806023  0.976592   NaN
1 -0.263802 -0.657153 -1.542347   NaN
2  1.213847  1.437288  0.824669   NaN
3  1.636961  0.642854  1.365133   NaN
4       NaN       NaN       NaN   NaN
5       NaN       NaN       NaN   NaN
6       NaN       NaN       NaN   NaN
7       NaN       NaN       NaN   NaN
8       NaN       NaN       NaN   NaN
9       NaN       NaN       NaN   NaN

In [17]:
pd.__version__

'1.2.4'

In [18]:
df2.reindex_like(df1,'ffill')    #ffill= forward filling

       col1      col2      col3      col4
0 -0.065259  2.806023  0.976592  0.976592
1 -0.263802 -0.657153 -1.542347 -1.542347
2  1.213847  1.437288  0.824669  0.824669
3  1.636961  0.642854  1.365133  1.365133
4  1.636961  0.642854  1.365133  1.365133
5  1.636961  0.642854  1.365133  1.365133
6  1.636961  0.642854  1.365133  1.365133
7  1.636961  0.642854  1.365133  1.365133
8  1.636961  0.642854  1.365133  1.365133
9  1.636961  0.642854  1.365133  1.365133

In [19]:
df2.reindex_like(df1,'ffill',limit=4)

       col1      col2      col3      col4
0 -0.065259  2.806023  0.976592  0.976592
1 -0.263802 -0.657153 -1.542347 -1.542347
2  1.213847  1.437288  0.824669  0.824669
3  1.636961  0.642854  1.365133  1.365133
4  1.636961  0.642854  1.365133  1.365133
5  1.636961  0.642854  1.365133  1.365133
6  1.636961  0.642854  1.365133  1.365133
7  1.636961  0.642854  1.365133  1.365133
8       NaN       NaN       NaN       NaN
9       NaN       NaN       NaN       NaN

In [20]:
df2.reindex_like(df1,'ffill',limit=5)

       col1      col2      col3      col4
0 -0.065259  2.806023  0.976592  0.976592
1 -0.263802 -0.657153 -1.542347 -1.542347
2  1.213847  1.437288  0.824669  0.824669
3  1.636961  0.642854  1.365133  1.365133
4  1.636961  0.642854  1.365133  1.365133
5  1.636961  0.642854  1.365133  1.365133
6  1.636961  0.642854  1.365133  1.365133
7  1.636961  0.642854  1.365133  1.365133
8  1.636961  0.642854  1.365133  1.365133
9       NaN       NaN       NaN       NaN

# Renaming

In [31]:
df=pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])

In [32]:
df

       col1      col2      col3
0  0.437824  0.475773  0.148051
1  1.191174 -0.437337  1.314210
2  0.014250 -0.433500  0.207256
3  0.369999  0.263118  0.289959
4 -1.758437  0.404727  0.320271
5 -0.273508  0.691092 -1.133045

In [33]:
df=df.rename(columns={'col1':'C1','col2':'C2','col3':'C3'})             
df

         C1        C2        C3
0  0.437824  0.475773  0.148051
1  1.191174 -0.437337  1.314210
2  0.014250 -0.433500  0.207256
3  0.369999  0.263118  0.289959
4 -1.758437  0.404727  0.320271
5 -0.273508  0.691092 -1.133045

In [34]:
df.rename(index={0:'rank1',1:'rank2'},inplace=False)            #Inplace= To define value

             C1        C2        C3
rank1  0.437824  0.475773  0.148051
rank2  1.191174 -0.437337  1.314210
2      0.014250 -0.433500  0.207256
3      0.369999  0.263118  0.289959
4     -1.758437  0.404727  0.320271
5     -0.273508  0.691092 -1.133045

In [35]:
df

         C1        C2        C3
0  0.437824  0.475773  0.148051
1  1.191174 -0.437337  1.314210
2  0.014250 -0.433500  0.207256
3  0.369999  0.263118  0.289959
4 -1.758437  0.404727  0.320271
5 -0.273508  0.691092 -1.133045

# Iteration

In [27]:
df=pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  1.033156  0.420679  0.774121
1 -0.121799  0.153909 -0.020286
2 -0.245432  0.888117 -0.234880
3  1.635236  1.116520  1.970703
4 -0.748315 -0.384439 -1.051968
5 -0.686988 -1.032194 -0.745204

In [28]:
for key,value in df.iteritems():
    print(key)
    print(value)

col1
0    1.033156
1   -0.121799
2   -0.245432
3    1.635236
4   -0.748315
5   -0.686988
Name: col1, dtype: float64
col2
0    0.420679
1    0.153909
2    0.888117
3    1.116520
4   -0.384439
5   -1.032194
Name: col2, dtype: float64
col3
0    0.774121
1   -0.020286
2   -0.234880
3    1.970703
4   -1.051968
5   -0.745204
Name: col3, dtype: float64

In [29]:
for key,value in df.iterrows():
    print(key)
    print(value)

0
col1    1.033156
col2    0.420679
col3    0.774121
Name: 0, dtype: float64
1
col1   -0.121799
col2    0.153909
col3   -0.020286
Name: 1, dtype: float64
2
col1   -0.245432
col2    0.888117
col3   -0.234880
Name: 2, dtype: float64
3
col1    1.635236
col2    1.116520
col3    1.970703
Name: 3, dtype: float64
4
col1   -0.748315
col2   -0.384439
col3   -1.051968
Name: 4, dtype: float64
5
col1   -0.686988
col2   -1.032194
col3   -0.745204
Name: 5, dtype: float64

# sorting

In [2]:
df=pd.DataFrame(np.random.randn(10,2),index=[1,2,6,2,3,5,8,7,9,10])

In [3]:
df

           0         1
1   0.673203 -0.520515
2  -0.069331  0.174388
6   0.225911  0.432950
2  -0.894319  0.830210
3   0.635459 -0.857032
5   0.244127  0.631007
8   1.042103  0.262250
7  -2.715469 -1.695597
9  -1.382950 -0.801575
10  0.012390  1.345110

In [7]:
df.sort_index()

           0         1
1   0.673203 -0.520515
2  -0.069331  0.174388
2  -0.894319  0.830210
3   0.635459 -0.857032
5   0.244127  0.631007
6   0.225911  0.432950
7  -2.715469 -1.695597
8   1.042103  0.262250
9  -1.382950 -0.801575
10  0.012390  1.345110

In [8]:
df.sort_values(by=[1])

           0         1
7  -2.715469 -1.695597
3   0.635459 -0.857032
9  -1.382950 -0.801575
1   0.673203 -0.520515
2  -0.069331  0.174388
8   1.042103  0.262250
6   0.225911  0.432950
5   0.244127  0.631007
2  -0.894319  0.830210
10  0.012390  1.345110

# Working With test data

In [11]:
s=pd.Series(['tom','mukul gupta','kanu','Sachin','Rajni','1234',np.nan,'john'])

In [10]:
s

0            tom
1    mukul gupta
2           kanu
3         Sachin
4          Rajni
5           1234
6            NaN
7           john
dtype: object

In [11]:
s.str.lower()

0            tom
1    mukul gupta
2           kanu
3         sachin
4          rajni
5           1234
6            NaN
7           john
dtype: object

In [12]:
s.str.upper()

0            TOM
1    MUKUL GUPTA
2           KANU
3         SACHIN
4          RAJNI
5           1234
6            NaN
7           JOHN
dtype: object

In [13]:
s.str.len()

0     3.0
1    11.0
2     4.0
3     6.0
4     5.0
5     4.0
6     NaN
7     4.0
dtype: float64

In [14]:
s.str.split()

0             [tom]
1    [mukul, gupta]
2            [kanu]
3          [Sachin]
4           [Rajni]
5            [1234]
6               NaN
7            [john]
dtype: object

In [12]:
s=pd.Series(['Tom','william Rick','john','alber@t'])

In [13]:
s

0             Tom
1    william Rick
2            john
3         alber@t
dtype: object

In [14]:
s.str.get_dummies()

   Tom  alber@t  john  william Rick
0    1        0     0             0
1    0        0     0             1
2    0        0     1             0
3    0        1     0             0

In [15]:
s.str.contains(' ')

0    False
1     True
2    False
3    False
dtype: bool

In [16]:
s.str.replace('@','a')

0             Tom
1    william Rick
2            john
3         alberat
dtype: object

In [17]:
s.str.repeat(2)

0                      TomTom
1    william Rickwilliam Rick
2                    johnjohn
3              alber@talber@t
dtype: object

In [18]:
s.str.count('m')

0    1
1    1
2    0
3    0
dtype: int64

In [19]:
s.str.startswith('T')

0     True
1    False
2    False
3    False
dtype: bool

In [20]:
s.str.endswith('t')

0    False
1    False
2    False
3     True
dtype: bool

In [21]:
s.str.find('e')

0   -1
1   -1
2   -1
3    3
dtype: int64

In [22]:
s.str.findall('l')

0        []
1    [l, l]
2        []
3       [l]
dtype: object

In [23]:
s.str.findall('m')

0    [m]
1    [m]
2     []
3     []
dtype: object

In [24]:
s.str.swapcase()

0             tOM
1    WILLIAM rICK
2            JOHN
3         ALBER@T
dtype: object

In [25]:
s.str.islower()

0    False
1    False
2     True
3     True
dtype: bool

In [26]:
s.str.islower()

0    False
1    False
2     True
3     True
dtype: bool

In [27]:
s.str.isnumeric()

0    False
1    False
2    False
3    False
dtype: bool

In [28]:
s.str.capitalize()

0             Tom
1    William rick
2            John
3         Alber@t
dtype: object

# Indexing and selecting index

In [3]:
df=pd.DataFrame(np.random.randn(8,4),
                index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D'])

In [4]:
df

          A         B         C         D
a  1.645099 -0.500953 -0.276909  1.154955
b -1.211945 -0.213637  1.479808  0.303137
c  0.807541 -0.743023  0.745793  0.727631
d -0.794968  0.963070  1.038746 -1.974864
e -0.051103  0.203573 -0.917241  0.224211
f -0.364653  0.964958  0.658397  1.133762
g  0.983489  0.833148  1.188152  0.640899
h  0.978081  0.552963 -1.664825 -0.149141

In [5]:
df['A']

a    1.645099
b   -1.211945
c    0.807541
d   -0.794968
e   -0.051103
f   -0.364653
g    0.983489
h    0.978081
Name: A, dtype: float64

In [6]:
df.loc[:,'A']

a    1.645099
b   -1.211945
c    0.807541
d   -0.794968
e   -0.051103
f   -0.364653
g    0.983489
h    0.978081
Name: A, dtype: float64

In [7]:

df.loc['a']

A    1.645099
B   -0.500953
C   -0.276909
D    1.154955
Name: a, dtype: float64

In [8]:
df.iloc[:,0]

a    1.645099
b   -1.211945
c    0.807541
d   -0.794968
e   -0.051103
f   -0.364653
g    0.983489
h    0.978081
Name: A, dtype: float64

In [9]:
df.loc[:,['A','C']]

          A         C
a  1.645099 -0.276909
b -1.211945  1.479808
c  0.807541  0.745793
d -0.794968  1.038746
e -0.051103 -0.917241
f -0.364653  0.658397
g  0.983489  1.188152
h  0.978081 -1.664825

In [10]:
df.loc['d',['A']]          #use loc to label value

A   -0.794968
Name: d, dtype: float64

In [11]:
df.iloc[3,[0,2]]            #use iloc to loc indexing

A   -0.794968
C    1.038746
Name: d, dtype: float64

# Missing Data

In [12]:
df=pd.DataFrame(np.random.randn(5,3),index=['a','c','e','g','i'],columns=['one','two','three'])

In [13]:
df

        one       two     three
a -0.438463 -0.702153 -1.175136
c -1.207963 -0.172824  0.466711
e -0.126742 -1.100827 -0.248786
g  1.330755 -0.990502 -1.185476
i  0.170716  0.945148 -0.165124

In [16]:
df=df.reindex(['a','b','c','d','e','f','g','h','i'])

In [17]:
df

        one       two     three
a -0.438463 -0.702153 -1.175136
b       NaN       NaN       NaN
c -1.207963 -0.172824  0.466711
d       NaN       NaN       NaN
e -0.126742 -1.100827 -0.248786
f       NaN       NaN       NaN
g  1.330755 -0.990502 -1.185476
h       NaN       NaN       NaN
i  0.170716  0.945148 -0.165124

In [18]:
df.isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f   True   True   True
g  False  False  False
h   True   True   True
i  False  False  False

In [19]:
df.isnull().any()    #to know which column has null value

one      True
two      True
three    True
dtype: bool

In [20]:
df.isnull().sum()

one      4
two      4
three    4
dtype: int64

In [22]:
df['one'].isnull().any()              #coulumn wise

True

In [23]:
df.fillna(0)

        one       two     three
a -0.438463 -0.702153 -1.175136
b  0.000000  0.000000  0.000000
c -1.207963 -0.172824  0.466711
d  0.000000  0.000000  0.000000
e -0.126742 -1.100827 -0.248786
f  0.000000  0.000000  0.000000
g  1.330755 -0.990502 -1.185476
h  0.000000  0.000000  0.000000
i  0.170716  0.945148 -0.165124

In [24]:
df.dropna()

        one       two     three
a -0.438463 -0.702153 -1.175136
c -1.207963 -0.172824  0.466711
e -0.126742 -1.100827 -0.248786
g  1.330755 -0.990502 -1.185476
i  0.170716  0.945148 -0.165124

In [25]:
df.fillna(method='pad')           #works same as ffill

        one       two     three
a -0.438463 -0.702153 -1.175136
b -0.438463 -0.702153 -1.175136
c -1.207963 -0.172824  0.466711
d -1.207963 -0.172824  0.466711
e -0.126742 -1.100827 -0.248786
f -0.126742 -1.100827 -0.248786
g  1.330755 -0.990502 -1.185476
h  1.330755 -0.990502 -1.185476
i  0.170716  0.945148 -0.165124

In [26]:
df.fillna(method='backfill')

        one       two     three
a -0.438463 -0.702153 -1.175136
b -1.207963 -0.172824  0.466711
c -1.207963 -0.172824  0.466711
d -0.126742 -1.100827 -0.248786
e -0.126742 -1.100827 -0.248786
f  1.330755 -0.990502 -1.185476
g  1.330755 -0.990502 -1.185476
h  0.170716  0.945148 -0.165124
i  0.170716  0.945148 -0.165124

In [27]:
df.fillna(method='ffill')

        one       two     three
a -0.438463 -0.702153 -1.175136
b -0.438463 -0.702153 -1.175136
c -1.207963 -0.172824  0.466711
d -1.207963 -0.172824  0.466711
e -0.126742 -1.100827 -0.248786
f -0.126742 -1.100827 -0.248786
g  1.330755 -0.990502 -1.185476
h  1.330755 -0.990502 -1.185476
i  0.170716  0.945148 -0.165124

In [30]:
df=pd.DataFrame(np.random.randn(5,3),index=['a','c','e','g','i'],columns=['one','two','three'])

In [31]:
df

        one       two     three
a  0.267268 -0.633906 -0.546148
c -2.993679 -1.171947  1.591987
e -0.305407 -1.290127 -0.557149
g -0.050076  0.985681 -0.778154
i -0.667255  0.164923  0.327260

In [33]:
df['one'].sum()

-3.7491500260670336

In [34]:
df['one'].sum()

-3.7491500260670336

# Group by

In [5]:
ipl_Data={'team':['Riders','Riders','Devils','Devils','Kings','kings','Kings','Kings','Riders','Royals','Royals','Riders'],
              'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
              'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
              'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [6]:
df=pd.DataFrame(ipl_Data)

In [39]:
df

      team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [40]:
df.groupby('Rank').agg({'team':'count'})

      team
Rank
1        4
2        4
3        2
4        2

In [42]:
df.groupby('Rank').agg({'team':'count'})

      team
Rank
1        4
2        4
3        2
4        2

In [44]:
df.groupby('Rank').agg({'team':'count'}).reset_index().rename(columns={'team':'rank_count'})

   Rank  rank_count
0     1           4
1     2           4
2     3           2
3     4           2

In [50]:
df.groupby(['Year','Points']).agg({'team':'sum'})

               team
Year Points
2014 701     Royals
     741      Kings
     863     Devils
     876     Riders
2015 673     Devils
     789     Riders
     804     Royals
     812      kings
2016 694     Riders
     756      Kings
2017 690     Riders
     788      Kings

In [51]:
df.drop_duplicates(subset='team').reset_index(drop=True)

     team  Rank  Year  Points
0  Riders     1  2014     876
1  Devils     2  2014     863
2   Kings     3  2014     741
3   kings     4  2015     812
4  Royals     4  2014     701

In [52]:
pd.read_csv('/Users/desktop.ini/sec')

<function pandas.io.parsers.read_csv(filepath_or_buffer: Union[ForwardRef('PathLike[str]'), str, IO[~T], io.RawIOBase, io.BufferedIOBase, io.TextIOBase, _io.TextIOWrapper, mmap.mmap], sep=<object object at 0x000002A142F9F230>, delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: Union[Dict[str, Any], NoneType] = None)>

In [56]:
df=pd.read_csv('D:/adult.data.csv')

In [57]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [5]:
s=pd.DataFrame(np.random.rand(5,4))

In [9]:
s

          0         1         2         3
0  0.341422  0.862368  0.246326  0.163718
1  0.607781  0.074343  0.172580  0.799048
2  0.712314  0.097825  0.775168  0.464672
3  0.827357  0.024117  0.951433  0.770156
4  0.918026  0.853919  0.660973  0.192995

array([[0.34142247, 0.86236816, 0.2463263 , 0.16371821],
       [0.60778139, 0.07434273, 0.17257976, 0.79904834],
       [0.71231416, 0.09782493, 0.77516775, 0.46467204],
       [0.82735729, 0.02411673, 0.95143348, 0.77015616],
       [0.91802625, 0.85391946, 0.66097305, 0.19299498]])

In [28]:
r=s.sum(axis=0)

In [29]:
r

0    3.406902
1    1.912572
2    2.806480
3    2.390590
dtype: float64

In [37]:
df = pd.read_csv('adult.data.csv')

In [11]:
df

      team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [4]:
import pandas as  pd
import numpy as np